### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [2]:
#Take a look at the top 5 rows of purchase_data
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [3]:
#count the unique SN to get total palyers
total_players=len(purchase_data['SN'].unique())
data={'Total Players':[total_players]}
pd.DataFrame(data)

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
#get unique id number 
number_of_unique_items=len(purchase_data['Item ID'].unique())

#get total revenue
total_revenue=purchase_data['Price'].sum()

#total revenue/ unique id number
number_of_purchases=len(purchase_data)
average_price=total_revenue/number_of_purchases

#summary
data=[[number_of_unique_items,average_price,number_of_purchases,total_revenue]]
columns=['Number of Unique Items','Average Price','Number of Purchases','Total Revenue']
summary=pd.DataFrame(data,columns=columns)
summary['Average Price']=summary['Average Price'].map('${:.2f}'.format)
summary['Total Revenue']=summary['Total Revenue'].map('${:.2f}'.format)
summary

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [5]:
#create original_purchase_data contains SN/Gender data
original_purchase_data=purchase_data[['SN','Gender']]

#remove duplicates
extracted_purchase_data=original_purchase_data.drop_duplicates()

#groupby and count
group_data=extracted_purchase_data.groupby('Gender').count()
group_data.columns=['Count']
group_data

                       Count
Gender
Female                    81
Male                     484
Other / Non-Disclosed     11

In [6]:
#assign value to femal/male/other&non-disclosed
group_data['Percentage']=extracted_purchase_data.groupby('Gender').count()
female=group_data.iloc[0,0]
male=group_data.iloc[1,0]
other=group_data.iloc[2,0]
print(male,female,other)

484 81 11

In [7]:
#Create summary
data={'Total Count':[male,female,other]}
summary=pd.DataFrame(data,columns=['Total Count'],index=['Male','Female','Other / Non-Disclosed'])
summary['Percentage of Players']=(summary['Total Count']/total_players*100).map('{:.2f}%'.format)
summary

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [ ]:
#group purchase_datas by gender

In [8]:
purchase_count=purchase_data.groupby('Gender')['SN'].count()
purchase_count.rename('Purchase Count',inplace=True)
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase Count, dtype: int64

In [9]:
average_purchase_price=purchase_data.groupby('Gender')['Price'].mean()
average_purchase_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [10]:
total_purchase_value=purchase_data.groupby('Gender')['Price'].sum()
total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [11]:
unique_person_by_gender=group_data.loc[:,'Count']
unique_person_by_gender

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: Count, dtype: int64

In [12]:
avg_total_purchase_per_person=total_purchase_value/unique_person_by_gender
avg_total_purchase_per_person

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [13]:
#create summary
data={'Purchase Count':purchase_count,'Average Purchase Price':average_purchase_price,
     'Total Purchase Value':total_purchase_value,'Avg Total Purchase per Person':avg_total_purchase_per_person}

summary=pd.DataFrame(data)
summary['Average Purchase Price']=summary['Average Purchase Price'].map('${:.2f}'.format)
summary['Total Purchase Value']=summary['Total Purchase Value'].map('${:,.2f}'.format)
summary['Avg Total Purchase per Person']=summary['Avg Total Purchase per Person'].map('${:.2f}'.format)
summary

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [14]:
#set bins and labels
bins=[0,9,14,19,24,29,34,39,50]
labels=['<10','10-14','15-19','20-24','25-29','30-34','35-39','40+']

In [15]:
#unique players
unique_players_data=purchase_data[['SN','Age']].drop_duplicates()

In [16]:
#add age_cat by pd.cut
unique_players_data['Age_Cat']=pd.cut(unique_players_data['Age'],bins=bins,labels=labels,right=True)
unique_players_data.head()

              SN  Age Age_Cat
0        Lisim78   20   20-24
1    Lisovynya38   40     40+
2     Ithergue48   24   20-24
3  Chamassasya86   24   20-24
4      Iskosia90   23   20-24

In [17]:
#get value_counts value for each cat
total_count=unique_players_data['Age_Cat'].value_counts(sort=False)
total_count.rename('Total Count',inplace=True)

<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: Total Count, dtype: int64

In [18]:
#calculate % for each cat
percentage_of_players=unique_players_data['Age_Cat'].value_counts(normalize=True,sort=False)
percentage_of_players=percentage_of_players*100
percentage_of_players.rename('Percentage of Players',inplace=True)

<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: Percentage of Players, dtype: float64

In [19]:
#create summary
summary=pd.DataFrame({'Total Count':total_count,'Percentage of Players':percentage_of_players})
summary['Percentage of Players']=summary['Percentage of Players'].map('{:.2f}%'.format)
summary

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [20]:
#set bins and labels
bins=[0,9,14,19,24,29,34,39,50]
labels=['<10','10-14','15-19','20-24','25-29','30-34','35-39','40+']

In [21]:
#add age_cat by pd.cut
purchase_data['Age_Count']=pd.cut(purchase_data['Age'],bins=bins,labels=labels)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age_Count
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [22]:
#get value_counts value for each cat
purchase_count=purchase_data['Age_Count'].value_counts(sort=False)
purchase_count.rename('Purchease Count',inplace=True)
purchase_count

<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchease Count, dtype: int64

In [23]:
#calculate average purchase price for each cat
average_purchase_price=purchase_data.groupby('Age_Count')['Price'].mean()
average_purchase_price.rename('Average Purchase Price',inplace=True)
average_purchase_price

Age_Count
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Average Purchase Price, dtype: float64

In [24]:
#calculate total price for each cat
total_purchase_value=purchase_data.groupby('Age_Count')['Price'].sum()
total_purchase_value.rename('Age Count',inplace=True)
total_purchase_value

Age_Count
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Age Count, dtype: float64

In [25]:
#calcualte average total purchase per person for each cat
avg_total_purchase_per_person=total_purchase_value/total_count
avg_total_purchase_per_person

Age_Count
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [26]:
#create summary
summary=pd.DataFrame({'Purchase Count':purchase_count,
                      'Average Purchase Price':average_purchase_price,
                     'Total Purchase Value':total_purchase_value,
                      'Avg total Purchase per Person':avg_total_purchase_per_person})
summary['Average Purchase Price']=summary['Average Purchase Price'].map('${:.2f}'.format)
summary['Total Purchase Value']=summary['Total Purchase Value'].map('${:.2f}'.format)
summary['Avg total Purchase per Person']=summary['Avg total Purchase per Person'].map('${:.2f}'.format)

summary

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg total Purchase per Person
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [27]:
#group purchase value by SN then calculate total purchase value
top_purchase_value=purchase_data.groupby('SN')['Price'].sum().sort_values(ascending=False)
top_purchase_value.rename('Total Purchase Value',inplace=True)
top_purchase_value.head()

SN
Lisosia93      18.96
Idastidru52    15.45
Chamjask73     13.83
Iral74         13.62
Iskadarya95    13.10
Name: Total Purchase Value, dtype: float64

In [28]:
#create datafarme for merege
total_purchase_value_df=pd.DataFrame(top_purchase_value)#.reset_index()
total_purchase_value_df.head()

             Total Purchase Value
SN
Lisosia93                   18.96
Idastidru52                 15.45
Chamjask73                  13.83
Iral74                      13.62
Iskadarya95                 13.10

In [29]:
#group purchase count by SN then calculate total purchase value
purchase_count=purchase_data.groupby('SN')['Purchase ID'].count()
purchase_count.rename('Purchase Count',inplace=True)
purchase_count.head()

SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
Name: Purchase Count, dtype: int64

In [30]:
#create datafarme for merege
purchase_count_df=pd.DataFrame(purchase_count)#.reset_index()
purchase_count_df.head()

              Purchase Count
SN
Adairialis76               1
Adastirin33                1
Aeda94                     1
Aela59                     1
Aelaria33                  1

In [31]:
#create summary
summary=pd.merge(purchase_count_df,total_purchase_value_df,on='SN')
summary.sort_values(by='Total Purchase Value',ascending=False,inplace=True)
summary['Average Purchase Price']=summary['Total Purchase Value']/summary['Purchase Count']
summary['Average Purchase Price']=summary['Average Purchase Price'].map('${:.2f}'.format)
summary['Total Purchase Value']=summary['Total Purchase Value'].map('${:.2f}'.format)
summary=summary[['Purchase Count','Average Purchase Price','Total Purchase Value']]
summary=summary.head()
summary

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [51]:
#get all item info
item_info=purchase_data[['Item ID','Item Name','Price']]
item_info

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [52]:
#get item sales info
purchase_count=item_info.groupby(['Item ID','Item Name'])['Item ID'].count()
purchase_count.rename('Purchase Count',inplace=True)
purchase_count.head()

Item ID  Item Name
0        Splinter              4
1        Crucifer              4
2        Verdict               6
3        Phantomlight          6
4        Bloodlord's Fetish    5
Name: Purchase Count, dtype: int64

In [54]:
#get average price for each item
price=item_info.groupby(['Item ID','Item Name']).mean()
price.columns=['Item Price']
price.head()

                            Item Price
Item ID Item Name
0       Splinter                1.2800
1       Crucifer                2.9425
2       Verdict                 2.4800
3       Phantomlight            2.4900
4       Bloodlord's Fetish      1.7000

In [55]:
#create summary ordered by purchase count descendingly
summary=pd.merge(purchase_count,price,on=['Item ID','Item Name'],how='left')
summary['Total Purchase Value']=summary['Purchase Count']*summary['Item Price']
summary.sort_values('Purchase Count',ascending=False,inplace=True)
summary['Item Price']=summary['Item Price'].map('${:.2f}'.format)
summary['Total Purchase Value']=summary['Total Purchase Value'].map('${:.2f}'.format)
summary.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [56]:
#create summary ordered by total purchase value descendingly
summary['Total Purchase Value']=[float(i.replace('$','')) for i in summary['Total Purchase Value']]
summary.sort_values('Total Purchase Value',ascending=False,inplace=True)
summary['Total Purchase Value']=summary['Total Purchase Value'].map('${:.2f}'.format)
summary.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80